Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS60/edc/PIC32CM2532LS60100.PIC
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP2PINCFG27" edc:nzwidth="0x8" edc:access="-n---nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x47" edc:_addr="0x4000315B">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:nzwidth="0x1" edc:desc="Peripheral Multiplexer Enable"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:nzwidth="0x1" edc:desc="Input Enable"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:nzwidth="0x1" edc:desc="Pull Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:nzwidth="0x1" edc:desc="Output Driver Strength Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP2PINCFG28" edc:nzwidth="0x8" edc:access="-n---nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x47" edc:_addr="0x4000315C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:nzwidth="0x1" edc:desc="Peripheral Multiplexer Enable"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:nzwidth="0x1" edc:desc="Input Enable"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:nzwidth="0x1" edc:desc="Pull Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:nzwidth="0x1" edc:desc="Output Driver Strength Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP2PINCFG29" edc:nzwidth="0x8" edc:access="-n---nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x47" edc:_addr="0x4000315D">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:nzwidth="0x1" edc:desc="Peripheral Multiplexer Enable"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:nzwidth="0x1" edc:desc="Input Enable"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:nzwidth="0x1" edc:desc="Pull Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:nzwidth="0x1" edc:desc="Output Driver Strength Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP2PINCFG30" edc:nzwidth="0x8" edc:access="-n---nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x47" edc:_addr="0x4000315E">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:nzwidth="0x1" edc:desc="Peripheral Multiplexer Enable"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:nzwidth="0x1" edc:desc="Input Enable"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:nzwidth="0x1" edc:desc="Pull Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:nzwidth="0x1" edc:desc="Output Driver Strength Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP2PINCFG31" edc:nzwidth="0x8" edc:access="-n---nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x47" edc:_addr="0x4000315F">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:nzwidth="0x1" edc:desc="Peripheral Multiplexer Enable"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:nzwidth="0x1" edc:desc="Input Enable"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:nzwidth="0x1" edc:desc="Pull Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:nzwidth="0x1" edc:desc="Output Driver Strength Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP2INTENCLR" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x40003160">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:nzwidth="0x1" edc:desc="Non-Secure Check Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP2INTENSET" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x40003164">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:nzwidth="0x1" edc:desc="Non-Secure Check Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP2INTFLAG" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x40003168">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:nzwidth="0x1" edc:desc="Non-Secure Check"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP2NONSEC" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4000316C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="NONSEC" edc:nzwidth="0x20" edc:desc="Port Security Attribution"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
