Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS60/edc/PIC32CM2532LS60100.PIC
      <edc:SFRDef ltx:memberofperipheral="DIB" edc:cname="DPIDR1" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0xE000EFE4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="PART_1" edc:nzwidth="0x4" edc:desc="Part number bits[11:8]"/>
            <edc:SFRFieldDef edc:cname="DES_0" edc:nzwidth="0x4" edc:desc="JEP106 identification code bits [3:0]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DIB" edc:cname="DPIDR2" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0xE000EFE8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="DES_1" edc:nzwidth="0x3" edc:desc="JEP106 identification code bits[6:4]"/>
            <edc:SFRFieldDef edc:cname="JEDEC" edc:nzwidth="0x1" edc:desc="JEDEC assignee value is used"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:nzwidth="0x4" edc:desc="Component revision"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DIB" edc:cname="DPIDR3" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0xE000EFEC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="CMOD" edc:nzwidth="0x4" edc:desc="Customer Modified"/>
            <edc:SFRFieldDef edc:cname="REVAND" edc:nzwidth="0x4" edc:desc="RevAnd"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DIB" edc:cname="DCIDR0" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000001101" edc:mclr="00000000000000000000000000001101" edc:impl="0xFF" edc:_addr="0xE000EFF0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="PRMBL_0" edc:nzwidth="0x8" edc:desc="CoreSight component identification preamble"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DIB" edc:cname="DCIDR1" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000010010000" edc:mclr="00000000000000000000000010010000" edc:impl="0xFF" edc:_addr="0xE000EFF4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="PRMBL_1" edc:nzwidth="0x4" edc:desc="CoreSight component identification preamble"/>
            <edc:SFRFieldDef edc:cname="CLASS" edc:nzwidth="0x4" edc:desc="CoreSight component class"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DIB" edc:cname="DCIDR2" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000101" edc:mclr="00000000000000000000000000000101" edc:impl="0xFF" edc:_addr="0xE000EFF8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="PRMBL_2" edc:nzwidth="0x8" edc:desc="CoreSight component identification preamble"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DIB" edc:cname="DCIDR3" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000010110001" edc:mclr="00000000000000000000000010110001" edc:impl="0xFF" edc:_addr="0xE000EFFC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="PRMBL_3" edc:nzwidth="0x8" edc:desc="CoreSight component identification preamble"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1F004" edc:_addr="0xE000F000"/>
      <edc:SFRDef ltx:memberofperipheral="ICB_NS" edc:cname="ICTR" edc:nzwidth="0x20" edc:access="----------------------------rrrr" edc:impl="0xF" edc:_addr="0xE002E004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICB_NS">
            <edc:SFRFieldDef edc:cname="INTLINESNUM" edc:nzwidth="0x4" edc:desc="Interrupt line set number"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICB_NS" edc:cname="ACTLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002E008"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE002E00C"/>
      <edc:SFRDef ltx:memberofperipheral="SysTick_NS" edc:cname="CSR" edc:nzwidth="0x20" edc:access="---------------n-------------nnn" edc:impl="0x10007" edc:_addr="0xE002E010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SysTick_NS">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="SysTick enable"/>
            <edc:SFRFieldDef edc:cname="TICKINT" edc:nzwidth="0x1" edc:desc="Tick interrupt"/>
            <edc:SFRFieldDef edc:cname="CLKSOURCE" edc:nzwidth="0x1" edc:desc="Clock source"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="COUNTFLAG" edc:nzwidth="0x1" edc:desc="Count flag"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SysTick_NS" edc:cname="RVR" edc:nzwidth="0x20" edc:access="-------n------------------------" edc:impl="0x1000000" edc:_addr="0xE002E014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SysTick_NS">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="RELOAD" edc:nzwidth="0x1" edc:desc="Counter reload value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SysTick_NS" edc:cname="CVR" edc:nzwidth="0x20" edc:access="-------n------------------------" edc:impl="0x1000000" edc:_addr="0xE002E018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SysTick_NS">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="CURRENT" edc:nzwidth="0x1" edc:desc="Current counter value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SysTick_NS" edc:cname="CALIB" edc:nzwidth="0x20" edc:access="rr------rrrrrrrrrrrrrrrrrrrrrrrr" edc:impl="0xC0FFFFFF" edc:_addr="0xE002E01C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SysTick_NS">
            <edc:SFRFieldDef edc:cname="TENMS" edc:nzwidth="0x18" edc:desc="Ten milliseconds"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SKEW" edc:nzwidth="0x1" edc:desc="Skew"/>
            <edc:SFRFieldDef edc:cname="NOREF" edc:nzwidth="0x1" edc:desc="No reference"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
