Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS60/edc/PIC32CM2532LS60100.PIC
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="PCFG4" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:addr="0x4100A180">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="PTOKEN" edc:nzwidth="0x2" edc:desc="Pipe Token"/>
            <edc:SFRFieldDef edc:cname="BK" edc:nzwidth="0x1" edc:desc="Pipe Bank"/>
            <edc:SFRFieldDef edc:cname="PTYPE" edc:nzwidth="0x3" edc:desc="Pipe Type"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="BINTERVAL4" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:addr="0x4100A183">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="BINTERVAL" edc:nzwidth="0x8" edc:desc="Bit Interval"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="PSTATUSCLR4" edc:nzwidth="0x8" edc:access="ww-w-w-w" edc:por="00000000" edc:mclr="00000000" edc:impl="0xD5" edc:addr="0x4100A184">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGL" edc:nzwidth="0x1" edc:desc="Data Toggle clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:nzwidth="0x1" edc:desc="Curren Bank clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:nzwidth="0x1" edc:desc="Pipe Freeze Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:nzwidth="0x1" edc:desc="Bank 0 Ready Clear"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:nzwidth="0x1" edc:desc="Bank 1 Ready Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="PSTATUSSET4" edc:nzwidth="0x8" edc:access="ww-w-w-w" edc:por="00000000" edc:mclr="00000000" edc:impl="0xD5" edc:addr="0x4100A185">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGL" edc:nzwidth="0x1" edc:desc="Data Toggle Set"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:nzwidth="0x1" edc:desc="Current Bank Set"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:nzwidth="0x1" edc:desc="Pipe Freeze Set"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:nzwidth="0x1" edc:desc="Bank 0 Ready Set"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:nzwidth="0x1" edc:desc="Bank 1 Ready Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="PSTATUS4" edc:nzwidth="0x8" edc:access="rr-r-r-r" edc:por="00000000" edc:mclr="00000000" edc:impl="0xD5" edc:addr="0x4100A186">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGL" edc:nzwidth="0x1" edc:desc="Data Toggle"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:nzwidth="0x1" edc:desc="Current Bank"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:nzwidth="0x1" edc:desc="Pipe Freeze"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:nzwidth="0x1" edc:desc="Bank 0 ready"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:nzwidth="0x1" edc:desc="Bank 1 ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="PINTFLAG4" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:addr="0x4100A187">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRCPT0" edc:nzwidth="0x1" edc:desc="Transfer Complete 0 Interrupt Flag"/>
            <edc:SFRFieldDef edc:cname="TRCPT1" edc:nzwidth="0x1" edc:desc="Transfer Complete 1 Interrupt Flag"/>
            <edc:SFRFieldDef edc:cname="TRFAIL" edc:nzwidth="0x1" edc:desc="Error Flow Interrupt Flag"/>
            <edc:SFRFieldDef edc:cname="PERR" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Flag"/>
            <edc:SFRFieldDef edc:cname="TXSTP" edc:nzwidth="0x1" edc:desc="Transmit  Setup Interrupt Flag"/>
            <edc:SFRFieldDef edc:cname="STALL" edc:nzwidth="0x1" edc:desc="Stall Interrupt Flag"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="PINTENCLR4" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:addr="0x4100A188">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRCPT0" edc:nzwidth="0x1" edc:desc="Transfer Complete 0 Disable"/>
            <edc:SFRFieldDef edc:cname="TRCPT1" edc:nzwidth="0x1" edc:desc="Transfer Complete 1 Disable"/>
            <edc:SFRFieldDef edc:cname="TRFAIL" edc:nzwidth="0x1" edc:desc="Error Flow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PERR" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXSTP" edc:nzwidth="0x1" edc:desc="Transmit Setup Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="STALL" edc:nzwidth="0x1" edc:desc="Stall Inetrrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="PINTENSET4" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:addr="0x4100A189">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRCPT0" edc:nzwidth="0x1" edc:desc="Transfer Complete 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TRCPT1" edc:nzwidth="0x1" edc:desc="Transfer Complete 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TRFAIL" edc:nzwidth="0x1" edc:desc="Error Flow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERR" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXSTP" edc:nzwidth="0x1" edc:desc="Transmit  Setup Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="STALL" edc:nzwidth="0x1" edc:desc="Stall Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="PCFG5" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:addr="0x4100A1A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="PTOKEN" edc:nzwidth="0x2" edc:desc="Pipe Token"/>
            <edc:SFRFieldDef edc:cname="BK" edc:nzwidth="0x1" edc:desc="Pipe Bank"/>
            <edc:SFRFieldDef edc:cname="PTYPE" edc:nzwidth="0x3" edc:desc="Pipe Type"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
